[
    {
        "id": 0,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Adrian",
        "text": "\"Hello everyone! Welcome to the June AI Meetup! It's so nice to see familiar faces and lots of new ones as well. We have three amazing speakers today who will guide us through some really hot topics in AI.\nFirst, let’s dive into the world of LLM Alignment.\""
    },
    {
        "id": 1,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Mihai",
        "text": "\"Thanks, Adrian. Hello everyone. Today I’ll talk about one of the hottest problems in AI — LLM Alignment.\nWhat is alignment? In simple terms, it's the effort to make AI systems behave in a way that aligns with human values and intentions.\n\nWhy is this hard?\nLet me give you an example. Suppose you ask an AI for job recommendations. If the training data is biased against certain genders or ethnic groups, the AI might reproduce that bias. We've seen this happen — AI recommending lower-paying jobs to women, for instance.\n\nAnother example is in financial services — models might deny credit to certain populations because of historic bias in the data.\n\nAnd this isn't just a static problem — it’s a snowball effect. If users start trusting AI-generated outputs, those outputs get recycled into future training data. This amplifies existing biases over time.\n\nSo what can be done? A few methods are in play:\n\n    Reinforcement Learning with Human Feedback (RLHF) — basically teaching the AI what is desirable or not.\n\n    Bias audits and dataset cleaning.\n\n    Differential privacy to prevent amplifying bad patterns.\n\nBut honestly — this is far from solved. Even OpenAI, Anthropic, DeepMind — they're struggling with this every day.\""
    },
    {
        "id": 2,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Ana",
        "text": "\"So... does this mean AI will eventually decide who gets rich and who doesn’t? Should we be worried about that?\""
    },
    {
        "id": 3,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Mihai",
        "text": "\"Great question... And yeah, partially, that’s why we care so much about alignment!\nBut no — we’re not at the Skynet level yet... unless Skynet comes with a customer service chatbot.\" 😄"
    },
    {
        "id": 4,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "George",
        "text": "\"What about cultural biases? Like, what’s polite in Japan might be rude in Germany. How do you align AI with multiple cultures?\""
    },
    {
        "id": 5,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Mihai",
        "text": "\"Excellent point. That’s one of the hardest parts. We don’t have a single 'human value' — we have many, depending on the context.\nOne direction is to train models that adapt based on location, culture, or user settings... but we’re just scratching the surface.\""
    },
    {
        "id": 6,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Adrian",
        "text": "\"Thank you, Mihai! That was awesome. Our next speaker is Ioana, who will talk about Multi-Agent Systems and AI Agents.\""
    },
    {
        "id": 7,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Ioana",
        "text": "\"Thanks, Adrian! Hi everyone. You’ve probably heard about LLMs — but what about AI Agents?\n\nThese are LLMs connected with tools, APIs, memory systems... capable of reasoning step by step, executing tasks, and even collaborating with other agents.\n\nAgent orchestration is one of the hottest topics in 2025.\nImagine an agent who reads your emails, updates your Jira board, sends reports, and even books your dentist appointment.\n\nThe challenge? Tool usage, reasoning failures, hallucinations, and cost.\nHow do you balance running 50 agents without spending your entire salary on API calls?\n\nAlso, agents aren't truly 'intelligent' — they simulate reasoning based on patterns learned from language. It’s cool but limited.\nFor example, they can plan, but they can’t really understand why they're doing it.\""
    },
    {
        "id": 8,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Dan",
        "text": "\"So... basically like interns but faster and cheaper?\" 😆"
    },
    {
        "id": 9,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Ioana",
        "text": "\"Exactly! But just like interns, sometimes they bring coffee... and sometimes they accidentally delete the whole database.\" ☕🔥"
    },
    {
        "id": 10,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Adrian",
        "text": "\"Thank you, Ioana!\nAnd now, for our last speaker, Radu, who will discuss Efficient Fine-Tuning of LLMs.\""
    },
    {
        "id": 11,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Radu",
        "text": "\"Hello everyone! I’ll make this quick and actionable.\nFine-tuning LLMs is expensive. But with techniques like LoRA (Low-Rank Adaptation) or QLoRA, you can fine-tune massive models on a laptop.\n\nThis allows companies to create custom AI models for their specific data — for example, medical reports, legal documents, or customer service transcripts.\n\nThe trend now is toward parameter-efficient fine-tuning, mixing with RAG systems for external memory, so the models don’t need to memorize everything but can fetch what they need.\""
    },
    {
        "id": 12,
        "date": "22-02-2020",
        "meetup_name": "kMeans",
        "speaker": "Adrian",
        "text": "\"Thank you, Radu! That was super useful.\nAnd thank you all for attending. Let’s grab a beer and keep chatting!\""
    }
]